app/controllers/articles_controller.rb

  def index
    @title = Article.all
---
SELECT "articles".* FROM "articles"